tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Version Control
# ------------------------------------------------
# Distributed revision control system
brew "git"
# Text interface for Git repositories
brew "tig"

# Terminal apps
# ------------------------------------------------
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Port scanning utility for large networks
brew "nmap"
# Improved top (interactive process viewer)
brew "htop"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Terminal multiplexer
brew "tmux"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Vi 'workalike' with many additional features
brew "vim"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# Simple, fast and user-friendly alternative to find
brew "fd"

# Extra terminal apps
# ------------------------------------------------
# Simplistic interactive filtering tool
brew "peco"
# Modern replacement for 'ls'
brew "exa"
# Fast, highly customisable system info script
brew "neofetch"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line fuzzy finder written in Go
brew "fzf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit", args: ["HEAD"]

# Embeded development tools
# ------------------------------------------------
# Cross-platform make
brew "cmake"
# Small build system for use with gyp or CMake
brew "ninja"
# Manage compile and link flags for libraries
brew "pkg-config"
# USB programmer
brew "dfu-util"
# Library for USB device access
brew "libusb"
# Open controller for the MiniPRO TL866xx series of chip programmers
brew "minipro"
brew "rbenv"


# Langauge support
# ------------------------------------------------
# Development kit for the Java programming language
brew "openjdk"
# Platform built on V8 to build network applications
brew "node"
# Python version management
brew "pyenv"

# Cask
# ------------------------------------------------
# Calculator and converter application
cask "numi"
# 3D creation suite
cask "blender"
# Multimedia player
cask "vlc"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Font for showing Icons
cask "font-hack-nerd-font"


#To install from brewfile run 'brew bundle --file <this-file>'
