tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/avr"

# Core application library for C
brew "glib"
# Atmel AVR MCU programmer
brew "avrdude"
# Blocking, shuffling and loss-less compression library
brew "c-blosc"
# Object-file caching compiler wrapper
brew "ccache"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Multipurpose sniffer/interceptor/logger for switched LAN
brew "ettercap"
# Modern replacement for 'ls'
brew "folly"
# File format designed to store large amounts of data
brew "hdf5"
# User interface to the TELNET protocol
brew "telnet"
# Watch files and take action when they change
brew "watchman"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@9"
